{
    "data": [
        {
            "author": "syvelior",
            "author_created_utc": 1302038913,
            "author_flair_css_class": "soc",
            "author_flair_text": "Language Acquisition | Bilingualism | Cognitive Development",
            "author_fullname": "t2_529n0",
            "body": "We tend to think that memory, etc is stored in the brain as a pattern of synaptic strength - that is, how readily one neuron can cause another to fire. Neurons can either be firing or not, so in that way they can be treated as binary, but it's not their state of activation so much as the *patterns* of activation that carry information.",
            "controversiality": 0,
            "created_utc": 1388733334,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg5mcx",
            "link_id": "t3_1u9z32",
            "nest_level": 1,
            "parent_id": "t3_1u9z32",
            "reply_delay": 19502,
            "retrieved_on": 1431778530,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "SimpleBen",
            "author_created_utc": 1337095213,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7q58c",
            "body": "The prevailing view, currently, is that enduring changes in the connectivity between distributed assemblies of neurons constitutes long-term memories. Very short term memories (up to 10s of seconds) can be carried by sustained activity in distributed assemblies of neurons. ",
            "controversiality": 0,
            "created_utc": 1388751793,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg93tk",
            "link_id": "t3_1u9z32",
            "nest_level": 1,
            "parent_id": "t3_1u9z32",
            "reply_delay": 37961,
            "retrieved_on": 1435539165,
            "score": 0,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "TMills",
            "author_created_utc": 1178124791,
            "author_flair_css_class": "computing",
            "author_flair_text": "Natural Language Processing | Computational Linguistics",
            "author_fullname": "t2_1mvrg",
            "body": "What you're saying is exactly right -- people who refer to the brain as being in some sense binary are referring to the all or nothing action potential (aka neurons \"firing\"). And I think at some point in neuroscience history there was a simplified understanding that this behavior was similar to how computer processors work. But now, as you mention, it is understood that the action potential patterns carry information. So, in retrospect, do you think it would be better if people stop using \"binary\" or \"binary code\" and just say that it is at the core a \"digital\" system (using discrete signals as opposed to an analog system with degrees of activation)?\n",
            "controversiality": 0,
            "created_utc": 1388753601,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg9ent",
            "link_id": "t3_1u9z32",
            "nest_level": 2,
            "parent_id": "t1_ceg5mcx",
            "reply_delay": 20267,
            "retrieved_on": 1431780309,
            "score": 0,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "SandyBaller",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "Good question, the simple explanation is that while in a binary system, only two options are available - this is not the case with neurons. This is because neurons communicate via the release of neurotransmitters, which constitute a large array of molecules. Even more importantly, the receptors for the neurotransmitters on the receving end come in many varieties. Two identical \"signals\" (neurotransmitter release) can infact have OPPOSITE effects on the cell if the receptors are different.\n\nSo really no, neurons are not at all binary.  ",
            "controversiality": 0,
            "created_utc": 1388756177,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg9wjh",
            "link_id": "t3_1u9z32",
            "nest_level": 1,
            "parent_id": "t3_1u9z32",
            "reply_delay": 42345,
            "retrieved_on": 1431780543,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388766518,
            "distinguished": null,
            "gilded": 0,
            "id": "cegd57w",
            "link_id": "t3_1u9z32",
            "nest_level": 1,
            "parent_id": "t3_1u9z32",
            "reply_delay": 52686,
            "retrieved_on": 1431782166,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388903083,
            "distinguished": null,
            "edited": 1388903265,
            "gilded": 0,
            "id": "cehp510",
            "link_id": "t3_1u9z32",
            "nest_level": 2,
            "parent_id": "t1_ceg9wjh",
            "reply_delay": 146906,
            "retrieved_on": 1431805348,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "BoldSignals",
            "author_created_utc": 1382644139,
            "author_flair_css_class": "neuro",
            "author_flair_text": "Cognitive Neuroscience | Neural Basis of Depression",
            "author_fullname": "t2_dmzk9",
            "body": "I don't think this is quite correct.\n\nFor one thing, while is true that there is an all or nothing principle when it comes to the generation of action potentials, the firing rate (the rate at which a neuron is generating action potentials) is never zero. \n\nThe relationship between a stimulus and the behavior of neurons (called neural coding) can be considered BOTH digital and analogue because it involves both alteration in the firing rate of individual neurons and the generation of activity within relatively discreet (well, sometimes) populations of neurons.\n\nAnyway, the distinction between analogue and digital when it comes to neural coding really oversimplifies the activity occurring in the brain. The electrical signals generated by neurons are (usually) intra-cellular- meaning that the signal propagates from one part of the cell (the cell body) to another (the terminal branches of the axon). These signals all tend to be the same amplitude (hence the all or none principle). In contrast, extra-cellular communications are chemical. The electical signal generated initially at the cell body eventually causes the release of neurotransmitters at the terminal branches. The effect of a neurotransmitter on nearby cells is then determined entirely by the receptors of those cells. Depending on the receptor type, the release of a neurotransmitter may cause nearby cells to be more likely to generate their own action potentials (and therefore release their own neurotransmitters) or less likely.\n\nNetworks of neurons- i.e. neurons that affect the firing rate of one another- interact with other networks, which interact with yet other networks, making the brain less a computer than a network of networked networks (the internet may be a more fitting analogy). Thus, while our individual brain cells may, in some ways, generate signals that look binary, processes as complex as memory are really the emergent product of a large number of cells working together in complex networks. ",
            "controversiality": 0,
            "created_utc": 1389722664,
            "distinguished": null,
            "gilded": 0,
            "id": "cepf3hp",
            "link_id": "t3_1u9z32",
            "nest_level": 4,
            "parent_id": "t1_ceggemr",
            "reply_delay": 948665,
            "retrieved_on": 1431939768,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        }
    ]
}