{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "Torque is the turning force that would be felt if you held the drive shaft - which is also the turning force you are applying *at any single instant*.\n\n(Horse)power is the work done per unit of time. If you applied that torque for a complete revolution and did that revolution in 1 second, that's a measure of (horse)power.\n\nIf i turn a crank and I strain with all my might, but the crank is held by a brake, I am applying torque but nothing is moving so there is no horsepower. \n\nHorsepower is simply a mathematical combination of torque and RPM: power = torque * distance / time.\n\nI don't understand how car engines work; I can't comment on the engine rpm vs rpm at the wheel vs torque.",
            "controversiality": 0,
            "created_utc": 1388624717,
            "distinguished": null,
            "gilded": 0,
            "id": "cef43d5",
            "link_id": "t3_1u64kk",
            "nest_level": 1,
            "parent_id": "t3_1u64kk",
            "reply_delay": 23505,
            "retrieved_on": 1427897835,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "fmilluminatus",
            "author_created_utc": 1332590035,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7959i",
            "body": "High torque, low RPM allows the engine to spread out the amount of energy needed to move the weight of the car over a longer period of time.  This helps the engine more easily overcome inertia when accelerating from a stop.  This is similar to why we use a pulley system to lift heavy weights - a person may not be able to exert the force necessary to dead lift a certain weight, but allowing them to spread that force out over time means they can exert a smaller force [one they can actually handle] over a time to successfully lift the weight.  High torque, low RPM gearing in engines works on the same principle.  \n\nAs far as at higher speeds, the wheels need to be turning at a certain rate to maintain a certain speed.  As the speed the wheels need to turn gets closer to the maximum RPM of the engine, we need to 'stretch' out the gearing so the engine isn't required to exceed it's maximum RPM to maintain or increase the car's current speed.  For example, at highway speeds the ratio between the number of rotations the engine makes and the number of rotations the wheels make eventually reach or exceed 1:1.  If we used lower gears at those speeds, it would require the engine to rotate at excessive RPM's to keep the wheels moving at the correct rate.  This would destroy the engine - in fact, this is exactly what happens during colloquially named 'money shifts', where drivers of a manual car accidentally shift to a low gear at high speed.  This causes the engine RPM's to spike far beyond it's capability, destroying some components of the engine.  [It's called a money shift because it's a very expensive mistake to fix.]",
            "controversiality": 0,
            "created_utc": 1388625734,
            "distinguished": null,
            "edited": 1388626315,
            "gilded": 0,
            "id": "cef4h4e",
            "link_id": "t3_1u64kk",
            "nest_level": 1,
            "parent_id": "t3_1u64kk",
            "reply_delay": 24522,
            "retrieved_on": 1427897655,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "rainman21043",
            "author_created_utc": 1347987164,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_91sa2",
            "body": "Horsepower = Torque x RPM\n\nWhen the car is stopped your engine is turning at 800 RPM or so so by definition horsepower is going to be pretty low.  Even with half the torque output at 4000 RPM, the horsepower is going to be much higher up there.\n\nIn general, the torque of an internal combustion engine drops as RPM increases, but since horsepower is multiplied by RPM you get a peak in horsepower up above 4000 RPM.  Depending on how fancy your engine is, your HP will peak at 4000, 5000, 7000, 10000 RPM (in an F1 race car...), wherever.  This does not mean you are shooting for \"Low Torque, High RPM\".  It's just difficult to tune an engine to get high torque at high RPM, and the higher your torque up there the higher your horsepower.\n\nAt low RPM, really the only way you're going to get good torque is through engine displacement.  You might be able to design a 3.0 liter engine with 600 HP by adding turbo / superchargers, DOHC with 4 or 5 valves per cylinder, intercoolers, variable valve timing and fancy intake / exhaust manifolds, etc.  But all of those expensive and high-maintenance add-ons really only help at higher RPMs and when your engine is turning at 2000 RPM they really don't do a whole lot.\n\nSo if you're in a sports car trying to get a good launch for 0-60, in a tweaky car with a smaller engine with high horsepower, you're going to have to rev up the engine to 5000 RPM or whatever and drop the clutch.  This obviously is hell on the transmission and you've got a car that will give you maintenance nightmares.  Fun to drive, very quick, can handle great because it's so light (large displacement engines are heavy), but it's going to be expensive to buy, expensive to maintain.\n\nIn a car with a 5 or 6 liter engine, you've got tons of torque even at 2000 RPM.  No need to tear your transmission up at the stop lights, just step on the gas and it's going to go.  If you're on the highway tooling along at 1000 RPM and you want to pass somebody, just step on the gas and your head will snap back.  In a small, light car with a tweaky engine you're probably going to need to downshift to get a higher rev before you pass.  A lot of people like this, since it gives the driver more interaction and makes the car more responsive, makes it a little more difficult to drive and more rewarding.\n\nThe confusion I think comes from people talking about \"torque\" as if it's just a low-RPM thing and \"horsepower\" as if it's a high-RPM thing  There is really no reason you can't have an engine that gets great power at low RPM as well as great power at high RPM - just get a 6 liter engine, add DOHC with 5 valves / cylinder, blow it with a supercharger / intercooler, add variable valve timing, etc.  None of these things hurt your low-RPM torque in the slightest, they just add horsepower at higher RPM.  Now you've got a heavy engine with huge power and you've got to beef up your suspension, clutch, transmission, wheels and tires, and it's probably going to have to be a mid-engine car because the driver has to be able to see.  Congratulations, you have just designed a car that barely anybody would consider practical and only the 1% of the 1% can afford.",
            "controversiality": 0,
            "created_utc": 1388629119,
            "distinguished": null,
            "gilded": 0,
            "id": "cef5swy",
            "link_id": "t3_1u64kk",
            "nest_level": 1,
            "parent_id": "t3_1u64kk",
            "reply_delay": 27907,
            "retrieved_on": 1427896963,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "rainman21043",
            "author_created_utc": 1347987164,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_91sa2",
            "body": "Some more clarification...\n\nIf you're in a truck trying to tow a heavy load (boat, trailer, etc) and your truck has a small, tweaky engine, say a 3L with 600 HP at 6000 RPM, well that's not going to work unless you have insanely low gear ratios (which you don't).  You can't exactly rev the engine up to max power at 6000 RPM and drop the clutch - you'd just burn rubber and barely move.  What you want here is an engine with lots of power at low RPM, and for whatever reason manufacturers have decided to characterize engines with high torque at low RPM in terms of peak torque -- \"400 ft-lbs of torque\" they advertise.  It would be just as correct to advertise \"100 HP at 1000 RPM!\" but that doesn't sound nearly as impressive even though it's the same thing.",
            "controversiality": 0,
            "created_utc": 1388629862,
            "distinguished": null,
            "gilded": 0,
            "id": "cef63hf",
            "link_id": "t3_1u64kk",
            "nest_level": 2,
            "parent_id": "t1_cef5swy",
            "reply_delay": 743,
            "retrieved_on": 1427896826,
            "score": 4,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "thewetness",
            "author_created_utc": 1377564910,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_cwmvx",
            "body": "The torque is measured as an output from the engine. It is basically how hard the engine is turning the driveshaft. Through a series of components, power (torque x rotational speed) is transmitted to the drive wheels. High torque will mean that the drive wheels will turn very forcefully. And RPM is really just how many times per minute the crankshaft undergoes a full rotation (I believe).\n\nThe purpose of a transmission is to change the torque and speed coming into the transmission to a more favorable torque/speed that will go to the drive wheels. It ideally, keeps the power equal on both sides, meaning the product of input torque x speed = output torque x speed. The ratio of torque out/ torque in is equal to the ratio of speed in/ speed out. This ratio is called the gear ratio R. There are inevitably losses due to friction, so some power is lost to heat. \n\nAnyway, say you start in first gear. This gear increases the torque and reduces the speed, so the wheels will turn hard to try to accelerate the car, but they dont need to turn very fast. Keep in mind that the and torque RPM arent measured from the wheels, but rather the crankshaft. Once you've sped up a little bit, say youve reached 3000 rpm at 15 mph. Your engine has to run faster to maintain the higher  wheel speed. However, if you still want to accelerate at the same rate, your engine will need to produce the same amount of torque (this is EXTREMELY IDEAL) at that faster speed, so it will use more power, thus more fuel. Instead, why don't we let the torque drop off a little as it reaches 3000 rpm, but once it gets there, lets shift up the gear, to second gear. Basically, this will cause the transmission to multiply its input torque (the engine torque) by a smaller R, but divide the engine speed by a smaller R. So even though output torque to the wheels is smaller, the engine can run at a rotational speed while still keeping the car going at 15 mph. This brings it back to a high torque, low speed operating point. This requires less power than a high torque and high speed operating point.\n\nTL;DR - basically when you use gearing you can use less power by using high torque - low speed combos or vice versa",
            "controversiality": 0,
            "created_utc": 1388641396,
            "distinguished": null,
            "gilded": 0,
            "id": "cefacjn",
            "link_id": "t3_1u64kk",
            "nest_level": 1,
            "parent_id": "t3_1u64kk",
            "reply_delay": 40184,
            "retrieved_on": 1427894841,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388663792,
            "distinguished": null,
            "gilded": 0,
            "id": "ceff0jf",
            "link_id": "t3_1u64kk",
            "nest_level": 2,
            "parent_id": "t1_cefacjn",
            "reply_delay": 22396,
            "retrieved_on": 1427892594,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "xzt123",
            "author_created_utc": 1388423504,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ekrat",
            "body": "I think it would be best to explain to you first what torque is and how it relates to force required to move an everyday object - a door. \n\nImagine a normal door in your house. If you push near the door handle furthest from the hinges the door swings easily. However, you have to push your hand forward about as far as the edge of the door will travel. Instead, if you were to push on the side of the door closest to the hinge, you would only need to push your hand forward a tiny bit to get the edge of the door to move a large distance, but you would have to push much harder. In the first case, you had maximum torque, in the latter case you had minimum torque. This is because Torque = Force X Displacement. This is the cross product of the force and displacement vectors. \n\nSo why would you want to push close to the hinge? Well, if you can push hard enough, you don't have to move your hand very far to make the door spin fast and far. However, if you don't want to push that hard you can push near the handle and it is very easy to swing the door, but you'll have to move your hand much further and faster to achieve the same affect, albeit with less force.\n\nNow imagine the door is very very heavy and 100 feet long. You push near the hinges, but you cannot get it to move at all, but if you push on the very edge of the door, then you can start to get it to move, slowly but surely. As it gets faster and faster you are walking quicker and quicker trying to turn it faster and faster. Pretty soon you are running at top speed and you cannot even catch up to the door to push it faster. So, you start to shift towards the hinge (towards the center of rotation) so that you do not have to move so far, now you can easily keep up with the door and keep pushing on it to turn it even faster, but had you started out this close to the hinge you wouldn't have been able to get it spinning.\n\nHorsepower is a measure of power (not force) but they are related. Work = force * distance and Power = Work / time.\n\nAs far as a car engine, if you start off in too high a gear, it is too difficult for the engine to accelerate and the engine could stall. If you are in too low of a gear for a speed, then your engine spins too quickly and is destroyed. (e.g.  in a 'money shift' situation a driver accidentally shifts down to a unintended gear. For example, instead of shifting from 4th to 5th gear, he accidentally shifts from 4th to 3rd at high RPM. Let's say the engine can only handle 8,000 RPM but now it hits 11,000 RPM. This could easily cause the valves to 'float' where they do not return to their resting position before the piston comes up and hits the valves destroying a good deal of the engine - bad news).\n\nAnother point here, is that it is more fuel efficient to operate at a lower RPM usually. Imagine the oversized door analogy. If you were just trying to keep the door spinning at a constant speed, you'd not want to spend a lot of extra energy running real fast trying to keep up with the edge of the door. You'd want to be closer to the axis of rotation so that you could give it a small constant force to overcome any drag/friction to keep it spinning at the same speed. \n\nI know you said that you've never driven a manual transmission car. Here's another good real life example, a bicycle with many gears. Have you ridden one? If you have, you have experienced the same exact thing as a car. What is it like to try to go up a hill in a high gear on a bicycle? Impossible, you can't pedal hard enough! What is it like to be in a low gear as your traveling very quickly? You have to pedal super fast but it is super easy!",
            "controversiality": 0,
            "created_utc": 1388676594,
            "distinguished": null,
            "edited": 1388677030,
            "gilded": 0,
            "id": "cefhtdk",
            "link_id": "t3_1u64kk",
            "nest_level": 1,
            "parent_id": "t3_1u64kk",
            "reply_delay": 75382,
            "retrieved_on": 1427891287,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "To be honest I think horsepower, torque and engine size are put there to confuse buyers.\n\nIf you're buying it for hauling or towing, get a diesel. In my opinion that is a complete and utter no-brainer (and except in the USA which hates diesel for some reason no-one can explain to me, I've never seen anyone use a petrol engine in a 4x4 or light truck).\n\nIf you're racing you probably want to know the 0-100 kmh or 100-160 acceleration times and how well it takes corners before you ask the engine size or horsepower.\n\nThey say larger engines are smoother but iIve yet to see the difference in a modern luxury car. They have so many computers, and stuff like active suspension (which detects acceleration and levels the car via computer control) to sort all that out.",
            "controversiality": 0,
            "created_utc": 1388689400,
            "distinguished": null,
            "gilded": 0,
            "id": "cefn432",
            "link_id": "t3_1u64kk",
            "nest_level": 3,
            "parent_id": "t1_cef63hf",
            "reply_delay": 59538,
            "retrieved_on": 1431769556,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "ChipotleMayoFusion",
            "author_created_utc": 1387352414,
            "author_flair_css_class": "eng",
            "author_flair_text": "Mechatronics",
            "author_fullname": "t2_eetr3",
            "body": "The engines and the wheels on your car are coupled by the gearbox. At any individual gear ratio, the engine and wheel speed is linear. If you double the engine speed you double the wheel speed. At high speeds, your engine needs to spin at higher RPM to keel up with the wheels. If the wheels try to spin faster than the engine, the engine will actually slow down the wheels.\n\nTorque with a given wheel size and gear ratio translates to force. Force with a given vehicle mass gives you acceleration, except for losses. If you want to get moving quickly, you need more acceleration. Once you are moving, all the force from your engine is going into losses, mostly air resistance. Because of this, you need torque at all speeds, but in different amounts. It is not a simple relationship, but in general the faster you want to get to top speed, the more torque you need. At high speed, the wind drag is proportional to V^2, so if you want to go three times as fast you need 9x more torque at that speed.\n\nGear ratios allow your car engine to reach both regions, low speed high torque and high speed low torque. A high gear ratio means that torque is being sacrificed for speed, and a low gear ratio is the opposite. It is linear, a 1:2 gear ratio decreases speed by 2x and increases torque by 2x.\n\nThe car engine doesn't produce the same torque at all speeds, it has a curve which peaks in a different place depending on the engine type. Electric motors peak at 0 RPM, and internal combustion engines often peak around 3000-4000RPM. The goal of the gearbox is to place that torque at the right speed depending on how fast your wheels are spinning.",
            "controversiality": 0,
            "created_utc": 1388794731,
            "distinguished": null,
            "edited": 1388794914,
            "gilded": 0,
            "id": "cegprqg",
            "link_id": "t3_1u64kk",
            "nest_level": 1,
            "parent_id": "t3_1u64kk",
            "reply_delay": 193519,
            "retrieved_on": 1431788212,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        }
    ]
}