{
    "data": [
        {
            "author": "dgm42",
            "author_created_utc": 1289083728,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4hyfh",
            "body": "The overall grid (which is much bigger than one municipality) has to be balanced. If the demand drops the generating units slow down and if it rises they pick up.\n\nA sudden change in the demand, either up or down, must be met with immediate changes in the generation capacity. In particular, a sudden drop in load caused by a transmission line going down must be met with an immediate shutdown of sufficient generators else they will be damaged.\n\nThe great black out of 1965 was caused by the generators at Niagara Falls tripping out. That caused the load to shift to other generators which then shut themselves down is self-protection. Because the whole eastern side of North America was one big interconnected grid the load kept shifting around and eventually almost everything had to shut down in self-protection.\n\nTo control this the generation and transmission utilities have very large computer simulations running that look for places in the network that would cause such instability if they were to fail and proactively move the generating capacity around to reduce the risk. The great blackout of 2003 was caused because these systems were inadequate and because FirstEnergy of Ohio failed to recognize that its grid was unstable.",
            "controversiality": 0,
            "created_utc": 1388600212,
            "distinguished": null,
            "gilded": 0,
            "id": "ceeuox0",
            "link_id": "t3_1u5hkw",
            "nest_level": 1,
            "parent_id": "t3_1u5hkw",
            "reply_delay": 29184,
            "retrieved_on": 1427902282,
            "score": 5,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "Merlin66",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "To much power generation increases the frequency of the grid, to little lowers it.  The utilities keep track of this and call it inadvertent.  They try to keep the value of inadvertent equal to zero.\n\nUtilities adjust generation though the Area Control Error (ACE) equation.\n\nACE = (Interchange Actual - Interchange Scheduled) - 10*(Frequency Bias) * (Frequency Actual - Frequency Scheduled).  The computer system calculates this every few seconds and increase or decreases generation as needed.\n\nInterchange is the sum of all power purchases and sales.  Interchange Actual is the measured value across lines (tie lines) that connect the utility to the grid.  Interchange Scheduled is the sum of the agreed upon purchases and sales.\n\nFrequency bias is a numerical value that is dependent upon the size of the utility.",
            "controversiality": 0,
            "created_utc": 1388605854,
            "distinguished": null,
            "gilded": 0,
            "id": "ceewuut",
            "link_id": "t3_1u5hkw",
            "nest_level": 1,
            "parent_id": "t3_1u5hkw",
            "reply_delay": 34826,
            "retrieved_on": 1427901273,
            "score": 4,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "lostchicken",
            "author_created_utc": 1354755078,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9t3ai",
            "body": "It's not just computers and modeling that runs the grid. At some point, it's a matter of grid operators picking up the phone and paying large industrial customers to use less power. They also get to be very, very good at predicting loads based on events that are happening. I read once where the British grid operators have to start up power plants to handle the load from tea kettles firing up right after EastEnders ends every day.\n\nIn short timescales, this isn't possible. It takes time to start and stop power plants. When the electrical load increases, it becomes physically more difficult to turn the synchronous AC generators inside the power plants. They ALL start to bog down, and the AC power frequency throughout the grid slows down. You can measure this yourself with an oscilloscope.\n\nWhen this happens, synchronous loads like big industrial motors slow down. This is good, because it means that in response to increased load elsewhere, all the other customers use less to make sure that the TOTAL power demand is balanced.\n\nNow for the bad news: modern power systems don't necessarily play nice. Computers need a certain amount of power to run. If the mains voltage drops, it just pulls more current. Solar power systems generate DC that's inverted back up to AC. They don't necessarily react to changes in the grid in the same way as big synchronous generators used to.\n\nIt's not an insurmountable problem, but it's certainly going to get tricky.",
            "controversiality": 0,
            "created_utc": 1388606673,
            "distinguished": null,
            "gilded": 0,
            "id": "ceex6eg",
            "link_id": "t3_1u5hkw",
            "nest_level": 2,
            "parent_id": "t1_ceeuox0",
            "reply_delay": 6461,
            "retrieved_on": 1427901123,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388607248,
            "distinguished": null,
            "gilded": 0,
            "id": "ceexevj",
            "link_id": "t3_1u5hkw",
            "nest_level": 2,
            "parent_id": "t1_ceeuox0",
            "reply_delay": 7036,
            "retrieved_on": 1427901014,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "ChoHag",
            "author_created_utc": 1303302018,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_54qts",
            "body": "They have to watch soap operas on the job so they know when the adverts (and, thus, kettles) are coming. It's not hearsay.\n\nI feel truly sorry for them.",
            "controversiality": 0,
            "created_utc": 1388617877,
            "distinguished": null,
            "gilded": 0,
            "id": "cef1ipy",
            "link_id": "t3_1u5hkw",
            "nest_level": 3,
            "parent_id": "t1_ceex6eg",
            "reply_delay": 11204,
            "retrieved_on": 1427899036,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "velcommen",
            "author_created_utc": 1354184609,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_9quom",
            "body": "In addition to what others have said, we run generators during off peak hours and store that energy for use during peak hours, when the power demand is greater than the supply from generators. 99% of storage capacity worldwide comes from http://en.wikipedia.org/wiki/Pumped-storage_hydroelectricity   Essentially during the night (and other non-peak hours) we pump water uphill. During peak power usage we let that water flow downhill and spin turbines to generate more power.",
            "controversiality": 0,
            "created_utc": 1388619500,
            "distinguished": null,
            "gilded": 0,
            "id": "cef2500",
            "link_id": "t3_1u5hkw",
            "nest_level": 1,
            "parent_id": "t3_1u5hkw",
            "reply_delay": 48472,
            "retrieved_on": 1427898746,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "3rdworldking",
            "author_created_utc": 1328272258,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_6tunc",
            "body": "We use a system of Capacitor Banks, and reactors.  A reactor is a transformer that doesn't have a secondary winding hooked up; so it takes excess voltage and \"burns\" it off.  What the system operators can do is lock in cap banks during heavy load and when there is light load they can lock in the reactors to take up the excess voltage from the line.",
            "controversiality": 0,
            "created_utc": 1390068461,
            "distinguished": null,
            "gilded": 0,
            "id": "cessjsg",
            "link_id": "t3_1u5hkw",
            "nest_level": 1,
            "parent_id": "t3_1u5hkw",
            "reply_delay": 1497433,
            "retrieved_on": 1431998661,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        }
    ]
}