{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388683716,
            "distinguished": null,
            "gilded": 0,
            "id": "cefkhvh",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 2575,
            "retrieved_on": 1431768324,
            "score": 4,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "prickneck",
            "author_created_utc": 1228459619,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3b9dv",
            "body": "The load time you experience is essentially the time it takes to load data from disk into memory (RAM) and then process this data once it's in memory. \n\nEven with recent advances in hard disk technology (solid state drives and so on), the speed of loading data from hard disk is many times slower than accessing it in RAM and therefore the majority of \"load time\" is comprised of this process. It does, however, depend on the program, which might be loading a small amount of data and then performing millions of complex calculations before the user is presented with something they can interact with. In this case, the bottleneck is CPU speed, as opposed to the hard disk.",
            "controversiality": 0,
            "created_utc": 1388684178,
            "distinguished": null,
            "gilded": 0,
            "id": "cefkpc2",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 3037,
            "retrieved_on": 1431768430,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388687084,
            "distinguished": null,
            "gilded": 0,
            "id": "cefm15x",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 5943,
            "retrieved_on": 1431769066,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388687702,
            "distinguished": null,
            "gilded": 0,
            "id": "cefmapw",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 6561,
            "retrieved_on": 1431769176,
            "score": 0,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "rocketsocks",
            "author_created_utc": 1206560773,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_346hz",
            "body": "There are two key parts to a computer, and they work in tandem. The first part is the processing hardware (the CPU), and it is basically instant on, it takes only the tiniest fraction of a second to go from unpowered to capable of any computation. The second is the \"state\" of the computer, and this is a complex extended system that requires a lot more steps to set up.\n\nIf all you want to do with a computer is add two numbers and store the result in a register, or something similarly low level, then a computer can do that in a single clock cycle and likely just as quickly after power is applied. However, we want computers to do a lot more for us. We want them to be connected to storage and displays. We want them to be able to communicate over the internet. We want them to run operating systems. And so on. Each of those activities requires a program. Those programs must be stored somewhere and in some, and accessing that storage also requires running programs. So there's a complicated bootstrapping dance that allow a computer to go from being turned off to having all of the relevant programs set up and running or available. Note that the term \"booting\" a computer comes from bootstrapping.\n\nIn cooking there is a concept called \"mise en place\", which is basically the organization of the ingredients and tools necessary to make a dish all set up so you have easy access to them when you start cooking. Booting up a computer is similar. All of the relevant code needed to do stuff is placed at hand for when it's needed.\n\nWhat you think of as the \"computer\" is actually a rather significant amount of software running on top of the raw hardware. All of that software needs to be retrieved from non-volatile storage (such as a hard drive) loaded into RAM, various initialization routines need to run, background services need to be set up, and the main kernel needs to be running.\n\nConsider the elaborate choreography that occurs when you type a single letter into the search field on google loaded in a browser. First, pressing the key fires off an event at the hardware level which causes a small sub-routine to run which stores a code denoting which key was pressed to be stored in a particular part of memory. Next, the pressing of the key causes code within the OS to run which keeps track of what applications are running and which component currently has focus at the moment and the OS passes off that information to the browser. The browser then figures out what to do with the signal, updates the state of the text input box so that the newly typed letter appears there, runs code to interpret javascript code that was tied to keypress events within that input field. There's an entire javascript engine running an interpreter/compiler which runs code which enables sending that keypress plus other data off to google. And this is achieved through yet more code which runs as part of the OS's network sub-system as well as the drivers for the network adapter, there is an elaborate, multi-layered dance of sub-systems that enables sending data to google and the return of instant search results and suggestions. This data is handed off from sub-system to sub-system until eventually it makes it to the javascript sub-system in the browser where it is processed and then used to update the currently displayed page. Which triggers the execution of various parts of the browser's code such as CSS processing, page rendering, additional javascript running, and so on. Meanwhile, all this time the OS has been running underneath everything, keeping track of windows and controls, constantly repainting the entire screen, and doing a million other background tasks and sub-systems. If you could visualize this you would see code execution jumping around across different parts of memory every fraction of a second.\n\nWe tend not to appreciate this sort of thing normally because usually it's just so very seamless and unobtrusive. But the fact is that your computer has to execute a tremendous amount of code just to process a keystroke and display the result on screen, and in order to do that it has to have a lot of code loaded into memory and properly configured, which takes a long time.\n\nIt is possible to store this state on disk and then retrieve it on boot and put it back in memory (this is called \"hibernating\") but even doing that requires a fairly extensive bootstrapping procedure (the system needs to be able to use various hardware, it needs to be able to read the data on the disk, etc.) which still can take more than a few seconds.",
            "controversiality": 0,
            "created_utc": 1388688887,
            "distinguished": null,
            "gilded": 0,
            "id": "cefmv4v",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 7746,
            "retrieved_on": 1431769440,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "NathanDeger",
            "author_created_utc": 1313916939,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pd5j",
            "body": "To make this a little easier to understand, imagine if you wanted to cook something.  Before you can start cooking you need all the ingredients to be taken out of the pantry And placed on your workspace (taking files from the hard drive and placing them into the RAM)  now let's pretend that you could place these items on the counter at the speed of light,  but you still have to look around in the pantry at normal speed to find them.  Hard drives have physical moving parts inside and are limited in his fast they can move around and find data. Also, there is a ton of bottlenecking in computers on boot up.  My computer that uses a special array of solid state hard drives (think s really big, really fast thumb drive)  that has no moving parts, and allows my computer to boot up in around 8 seconds.  Most of that time is spent on system checks (imagine you had to stand in the middle of your kitchen and look around to make sure you still had a counter top, a stove,  a fridge and a cutting board.  That's all a \"hardware check\") I hope that clears some stuff up!  PCMASTERRACE!!! ",
            "controversiality": 0,
            "created_utc": 1388690096,
            "distinguished": null,
            "gilded": 0,
            "id": "cefngm3",
            "link_id": "t3_1u8ksx",
            "nest_level": 2,
            "parent_id": "t1_cefkhvh",
            "reply_delay": 6380,
            "retrieved_on": 1431769721,
            "score": 8,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388691689,
            "distinguished": null,
            "gilded": 0,
            "id": "cefo7h1",
            "link_id": "t3_1u8ksx",
            "nest_level": 3,
            "parent_id": "t1_cefngm3",
            "reply_delay": 1593,
            "retrieved_on": 1431770073,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388691695,
            "distinguished": null,
            "edited": 1396793289,
            "gilded": 0,
            "id": "cefo7km",
            "link_id": "t3_1u8ksx",
            "nest_level": 3,
            "parent_id": "t1_cefnk5b",
            "reply_delay": 1393,
            "retrieved_on": 1431770075,
            "score": -1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "tjandearl",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "That's a really good but partial answer.  To further elaborate on WHY it has to load it is because RAM is very fast and a HDD isn't.  Why not juse use more RAM though? RAM is volatile, meaning that if left to it's own devices it will loose what it is storing without being refreshed.  Refreshing ram consumes power which is expensive and if you loose power you loose anything stored in RAM.  A HDD is nonvolatile in that you can unplug it for years and boot off it again, it's a long term storage device that sacrifices speed for data longevity and storage cost.",
            "controversiality": 0,
            "created_utc": 1388691996,
            "distinguished": null,
            "gilded": 0,
            "id": "cefocpf",
            "link_id": "t3_1u8ksx",
            "nest_level": 3,
            "parent_id": "t1_cefngm3",
            "reply_delay": 1900,
            "retrieved_on": 1431770141,
            "score": 5,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388692951,
            "distinguished": null,
            "gilded": 0,
            "id": "cefotkh",
            "link_id": "t3_1u8ksx",
            "nest_level": 4,
            "parent_id": "t1_cefocpf",
            "reply_delay": 955,
            "retrieved_on": 1431770361,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388693098,
            "distinguished": null,
            "gilded": 0,
            "id": "cefovzq",
            "link_id": "t3_1u8ksx",
            "nest_level": 2,
            "parent_id": "t1_cefn6kw",
            "reply_delay": 3555,
            "retrieved_on": 1431770394,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "Niriel",
            "author_created_utc": 1315480184,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5tfn7",
            "body": "The computer in your microwave is not fundamentally different from the one with which you are reading this.  Processor, memory, inputs and output devices.  Why is the microwave ready to operate as soon as it is plugged while a desktop computer can take a couple of minutes?\n\nThe microwave has a single program, coded into a read-only memory (ROM).  As soon as the microwave is powered up, the processor starts executing the instructions in this chip.  It needs nothing else than that program so it is good to go.\n\nA general computer (and for this I'll even call iPhones general computers, despite the efforts of Apple) would be boring if it had only one program.  So there *is* a ROM that contains a program, but that program (\"firmware\", like [BIOS](http://en.wikipedia.org/wiki/BIOS) for instance) starts another program (\"boot loader\") which starts another program (\"operating system\" or OS), which goal is to let the user start the program they want (\"application\").  There can be even more layers.  For example, the boot loader could load a [second-stage boot loader](http://en.wikipedia.org/wiki/Booting#Second-stage_boot_loader) (like GRUB), which lets you choose which OS you want to start (on a machine with several partitions and/or windows/linux versions).\n\nBut before the firmware even tries to localize the boot loader on your hard drive/CD/usb-stick, it has do do a lot of waking-up and setting-up of all the hardware.  That is called \"[Power-on self-test](http://en.wikipedia.org/wiki/Power-on_self-test)\", and even though most of it is on-chip (and not mechanical like hard drives) there is a lot to do and this takes time.  A microwave does not need that since its hardware is fixed.\n\nThe first operating systems were small and did not offer much choice so they were straightforward and quick to load.  Nowadays, many operating systems are very modular.  You can choose your kernel, your file systems, your command-line interpreter, your display server, your compositing manager, your widget library, etc., all of that which is supposed to load before you can actually DO something.  Each of these many pieces of code reside in many files, each with configurations and data that reside in many other files.  This is a LOT of file access, and accessing many small files is slower than accessing a big one (at least with mechanical disks).  However, slow mass storage is not the only source of slowness.\n\nAccording to [this article](http://gec.di.uminho.pt/discip/minf/ac0102/1000Gap_Proc-Mem_Speed.pdf), processors became a thousand times faster in 20 years but the memory speed was not even multiplied by ten.  This means that memory is a massive bottleneck.  Moving data from RAM to CPU registers can take several hundreds of CPU cycles, that means that the CPU could have been executing 200 instructions but it cannot because it is waiting for that stupid data to come from memory.  So we gave smaller and fasters tiny bits of memory to the CPU, called \"cache\", but this is not enough.  Indeed  many modern programming languages emphasize things like \"objects\" and \"pointers\", which means that the data is scattered in tiny chunks all over the RAM instead of being consolidated in continuous bytes of memory.  As a result, programs written in these languages (and that is MANY) are slow because the [CPU caches hardly ever contain the data you want](http://en.wikipedia.org/wiki/CPU_cache#Cache_miss).  This is not a problem with the first steps of the boot process, such as boot loader, and even kernel, but it becomes a massive problem when the graphical user interface starts working.\n\nTL;DR: not only the hardware is slow, but there are a LOT of things going on before the machine lets you do something.",
            "controversiality": 0,
            "created_utc": 1388693552,
            "distinguished": null,
            "gilded": 0,
            "id": "cefp3iy",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 12411,
            "retrieved_on": 1431770493,
            "score": 7,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "devinblk7",
            "author_created_utc": 1306331721,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5a9n1",
            "body": "I have always liked the office analogy. Where your hard drive is a filing cabinet and your RAM is your physical desktop. You cannot work on a file that is in the filing cabinet, you have to find it, pull it out, and put it on your desk. Then you can make your changes to the file and store it back in the filing cabinet.",
            "controversiality": 0,
            "created_utc": 1388694523,
            "distinguished": null,
            "gilded": 0,
            "id": "cefpjgi",
            "link_id": "t3_1u8ksx",
            "nest_level": 3,
            "parent_id": "t1_cefngm3",
            "reply_delay": 4427,
            "retrieved_on": 1431770784,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "jshine1337",
            "author_created_utc": 1336526970,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7o8jn",
            "body": "Just a small addition from a software perspective:\n\nSoftware varies in size (based on factors, such as lines of code and type of operations occurring) which means on a hard drive one program can take up a greater portion of the hard drive's space versus another program. Logically, the larger program would take longer to load than the smaller one (assuming all other conditions stay the same.)\n\nHere's an interesting graphic depicting the number of lines of code for various pieces of software or software systems: http://dailyinfographic.com/wp-content/uploads/2013/10/1276_lines_of_code2.png\n\nWindows 7 is somewhere on the order of 40 million, where Windows 3.1 was only around 3 million.",
            "controversiality": 0,
            "created_utc": 1388697836,
            "distinguished": null,
            "gilded": 0,
            "id": "cefr4fa",
            "link_id": "t3_1u8ksx",
            "nest_level": 2,
            "parent_id": "t1_cefn6kw",
            "reply_delay": 8293,
            "retrieved_on": 1431771519,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "tjandearl",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "If you love computers check out cars!  You can find a cheap car and make it awesome just like you could a computer.  They are both fascinating works of human engineering too!  I love learning how stuff works.",
            "controversiality": 0,
            "created_utc": 1388699352,
            "distinguished": null,
            "gilded": 0,
            "id": "cefrvh1",
            "link_id": "t3_1u8ksx",
            "nest_level": 5,
            "parent_id": "t1_cefotkh",
            "reply_delay": 6401,
            "retrieved_on": 1431771880,
            "score": 5,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "GalacticCannibalism",
            "author_created_utc": 1314078466,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_5pqmq",
            "body": "You mentioned HDD, which is one of the few parts in the computer that \"move\" - fans would be another example.I'm assuming the read and write function is part of the reason they're slow. What about a SSD?",
            "controversiality": 0,
            "created_utc": 1388700701,
            "distinguished": null,
            "gilded": 0,
            "id": "cefsizt",
            "link_id": "t3_1u8ksx",
            "nest_level": 4,
            "parent_id": "t1_cefocpf",
            "reply_delay": 8705,
            "retrieved_on": 1431772185,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388700945,
            "distinguished": null,
            "edited": 1396793292,
            "gilded": 0,
            "id": "cefsmsp",
            "link_id": "t3_1u8ksx",
            "nest_level": 5,
            "parent_id": "t1_cefruv6",
            "reply_delay": 1626,
            "retrieved_on": 1431772230,
            "score": -4,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388702224,
            "distinguished": null,
            "gilded": 0,
            "id": "ceft7or",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 21083,
            "retrieved_on": 1431772504,
            "score": 0,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "YoYoDingDongYo",
            "author_created_utc": 1378512025,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_d1gsr",
            "body": "I've seen that one before and I just can't believe that healthcare.gov is 500 million lines of code.  It just doesn't seem possible that they brought that together in such a short time.",
            "controversiality": 0,
            "created_utc": 1388703876,
            "distinguished": null,
            "gilded": 0,
            "id": "ceftyzx",
            "link_id": "t3_1u8ksx",
            "nest_level": 3,
            "parent_id": "t1_cefr4fa",
            "reply_delay": 6040,
            "retrieved_on": 1431772872,
            "score": 5,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "raygundan",
            "author_created_utc": 1288672548,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4hf38",
            "body": "&gt; A lot of people are sort of implying that the finite speed of light is an important part of why computer operations take noticeable amounts of time. This is incorrect.\n\nWhile I'd agree that the slower storage is the biggest limiter, execution time still affects how long this takes.  And at 3Ghz, something traveling the speed of light can only travel about ten centimeters in one clock cycle.  But the speed of light is really a maximal upper bound, and the group propagation speed is only about a third of that.   Unless I've horribly misunderstood something, we really are at the point where the speed of light places noticeable constraints on how fast we can do things.",
            "controversiality": 0,
            "created_utc": 1388705617,
            "distinguished": null,
            "gilded": 0,
            "id": "cefuqyn",
            "link_id": "t3_1u8ksx",
            "nest_level": 2,
            "parent_id": "t1_cefn6kw",
            "reply_delay": 16074,
            "retrieved_on": 1431773227,
            "score": 7,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "DanielSank",
            "author_created_utc": 1372305369,
            "author_flair_css_class": "physics",
            "author_flair_text": "Quantum Information | Electrical Circuits",
            "author_fullname": "t2_c6gwm",
            "body": "&gt;  Unless I've horribly misunderstood something, we really are at the point where the speed of light places noticeable constraints on how fast we can do things.\n\nNo, you haven't misunderstood. I was just trying to address the original question about why \"loading\" takes time on a computer.\n\nThere is an upper limit on clock speed because of the size of the chip, but as I understood from talking to an Intel rep. a few months ago that's not the current limiting factor. This is demonstrated by the fact that computers with solid state permanent storage boot _much_ faster than computers with spinning mechanical drives.",
            "controversiality": 0,
            "created_utc": 1388713088,
            "distinguished": null,
            "gilded": 0,
            "id": "cefx7vz",
            "link_id": "t3_1u8ksx",
            "nest_level": 3,
            "parent_id": "t1_cefuqyn",
            "reply_delay": 7471,
            "retrieved_on": 1435539336,
            "score": 4,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "5n0wm4n",
            "author_created_utc": 1386959964,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ecbfq",
            "body": "You only have to do this 28 times to get to 500,000,000: select all, copy, paste ",
            "controversiality": 0,
            "created_utc": 1388717175,
            "distinguished": null,
            "gilded": 0,
            "id": "cefz1rk",
            "link_id": "t3_1u8ksx",
            "nest_level": 4,
            "parent_id": "t1_ceftyzx",
            "reply_delay": 13299,
            "retrieved_on": 1431775333,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388718539,
            "distinguished": null,
            "gilded": 0,
            "id": "cefzot2",
            "link_id": "t3_1u8ksx",
            "nest_level": 1,
            "parent_id": "t3_1u8ksx",
            "reply_delay": 37398,
            "retrieved_on": 1431775635,
            "score": 0,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "raygundan",
            "author_created_utc": 1288672548,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_4hf38",
            "body": "Pipelining addresses a lot of it-- it doesn't matter in many situations if it takes 20 cycles for something to work through, because the pipe still spits out one answer each cycle. ",
            "controversiality": 0,
            "created_utc": 1388718743,
            "distinguished": null,
            "gilded": 0,
            "id": "cefzsb8",
            "link_id": "t3_1u8ksx",
            "nest_level": 4,
            "parent_id": "t1_cefx7vz",
            "reply_delay": 5655,
            "retrieved_on": 1431775681,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "DanielSank",
            "author_created_utc": 1372305369,
            "author_flair_css_class": "physics",
            "author_flair_text": "Quantum Information | Electrical Circuits",
            "author_fullname": "t2_c6gwm",
            "body": "&gt; Pipelining addresses a lot of it\n\nIndeed.\n\nAlso, switching speeds depend on parameters like capacitance and resistance that have nothing to do with the speed of light.",
            "controversiality": 0,
            "created_utc": 1388719577,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg06ha",
            "link_id": "t3_1u8ksx",
            "nest_level": 5,
            "parent_id": "t1_cefzsb8",
            "reply_delay": 834,
            "retrieved_on": 1431775866,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        }
    ]
}