{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388643097,
            "distinguished": null,
            "gilded": 0,
            "id": "cefaw66",
            "link_id": "t3_1u79rq",
            "nest_level": 1,
            "parent_id": "t3_1u79rq",
            "reply_delay": 11639,
            "retrieved_on": 1427894587,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "SandyBaller",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "Excellent question, I can understand where you would be confused. \nTo answer your tl;dr question bluntly - Yes, more or less. Now to explain:\n\nTypically, all your APs that fire will originate at the Axon Hillock because that is where the summation of input occurs. Note that the action potential itself is ONLY propagated through the axon, never in the cell body. Once it reaches the cell body, it disperses throughout the cell body (loses voltage). The axon hillock is simply where depolarization can accumulate in order to fire the action potential; the cell body itself is too large to depolarize entirely. \n\nSo yes, the action potential itself will only propagate throughout the axon, originating from the axon hillock. An exception to this would be axo-axonal connections, but those are typically inhibitory as opposed to stimulatory. \n\nIf you want further clarification please ask.\n\nSource: Neurobiology TA ",
            "controversiality": 0,
            "created_utc": 1388646975,
            "distinguished": null,
            "gilded": 0,
            "id": "cefbzoz",
            "link_id": "t3_1u79rq",
            "nest_level": 1,
            "parent_id": "t3_1u79rq",
            "reply_delay": 15517,
            "retrieved_on": 1427894076,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "drjgm74",
            "author_created_utc": 1388132998,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ej47b",
            "body": "This isn't something I had thought much about.\n\nI guess the key thing to understand is the events leading up to depolarisation of a neuron. The cell body of the neuron may synapses with one or several presynaptic neurons. When those presynaptic neurons depolarise they release neurotransmitter into the synaptic cleft. The neurotransmitter binds to ligand-gated cation channels, as you know.\n\nNow - different to what you have been taught - this does not cause immediate depolarisation of the postsynaptic neuron. Not at all. There are several variable little steps that occur. A ligand-gated cation channel opens and creates a mini end plate potential (MEPP)  (due to the cation flow across cell membrane). This allows adjacent voltage-gated cation channels to open creating a zone of depolarisation. This is a small potential and could be inhibitory (IPSP) or excitatory (EPSP) depending upon whether it was triggered by inhibitory (eg. GABA) or excitatory (eg. glutamate) presynaptic neuron.\n\nFor the neuron to depolarise these small IPSP and EPSP need to add up to a sufficient level to trigger generalised opening of a large number of voltage gated cation channels. The Axon Hillock is the area (where is was thought) there is the greatest number of these channels. If the postsynaptic depolarisation is sufficient to depolarise the membrane in the area of the Axon Hillock above a trigger threshold then all the voltage gated channels at the Hillock can open. The number of channels at the Axon Hillock is such that the opening of them all is sufficient to generate a potential of sufficient size that it can travel down the axon either by saltatory conduction or non-saltatory conduction. \n\nMaybe that is better put by saying , the Axon Hillock is the area where there is summation of IPSPs and EPSPs, and  triggering of mass depolarisation, leading to generation of an action potential. \n\nPS: To be pedantic, I think the actual trigger zone is nowadays considered to be just distal to the axon hillock. I'm not sure if this level of detail is required. I always thought it more important to understand the various channels and the potentials generated and summation of those.",
            "controversiality": 0,
            "created_utc": 1388647859,
            "distinguished": null,
            "edited": 1388649492,
            "gilded": 0,
            "id": "cefc7ix",
            "link_id": "t3_1u79rq",
            "nest_level": 1,
            "parent_id": "t3_1u79rq",
            "reply_delay": 16401,
            "retrieved_on": 1427893974,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "drjgm74",
            "author_created_utc": 1388132998,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ej47b",
            "body": "i was under the impression that there were postsynaptic receptors scattered throughout the cell membrane but there was a greater number of receptors at, or just distal to, the Axon Hillock.\n\nYes, the whole cell doesn't need to depolarise. I imagine that you have a whole lot of little zones of depolarisation occurring all around the cell membrane, like little sparks, and some of these sparks can cause little sparks nearby, but the channels are too few and far between so you can't trigger an explosion (mass depolarisation). In fact, the normal resting state of the cell probably has all these little sparks flashing as channels cycle and small currents/potentials occur but they are few and far apart.\n\nBut near the Axon Hillock there are large amount of receptors packed in there, so a few sparks landing in there, set off a few channels, and then the surrounding channels and BOOM!\n\nI'm pretty sure that there isn't an intracellular protein that travels across the cell. It is due to the effect of these areas of electrical potential, and a function of the electric fields generated across the cell membrane. Remember one channel depolarising creates current flow across the membrane and an electrical field spreading out on the surface of the membrane (radially). This electrical field strength drops (inversely proportional to distance squared) but still it is able to cause effects some distance away (from the point of view of the channel). So when one channel sparks it can trigger another channel that seems far far away from the point of view of the channel.\n\n",
            "controversiality": 0,
            "created_utc": 1388675474,
            "distinguished": null,
            "edited": 1388676014,
            "gilded": 1,
            "id": "cefhgnl",
            "link_id": "t3_1u79rq",
            "nest_level": 3,
            "parent_id": "t1_cefe2oz",
            "reply_delay": 18016,
            "retrieved_on": 1427891452,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "adoarns",
            "author_created_utc": 1132981200,
            "author_flair_css_class": "med",
            "author_flair_text": "Neurology",
            "author_fullname": "t2_1v9c",
            "body": "It's complicated.\n\nAction potentials reach synapses and then cause the emission of neurotransmitters across the synaptic cleft. Depending on the nature of the neurotransmitter, when it meets its receptor on the postsynaptic neuron, it can cause either an excitatory or an inhibitory postsynaptic potential (EPSP or IPSP). So far so good. \n\nNote that axons from one cell can synapse on dendrites, axons, or even somata (cell bodies) of other neurons. Or even on itself.\n\nWhen a cell has a dense arbor of dendrites, each local part will receive its various EPSPs and IPSPs. Dendrites are much less likely to cause APs and usually propagate voltage changes *electrotonically*--as a simple wave that peters out with distance.\n\nThe axon hillock, because of its configuration of voltage-gated ion channels, is most sensitive to causing APs. EPSPs from dendrites, the soma, the hillock, if they can all push the membrane voltage above threshold together, will ignite a spike. The AP typically runs down the axon towards its synapses. But it can also move backward through the soma and into the dendrites, where changes in membrane voltage and release of neurotransmitters can induce changes in the *strength* of the various synapses, making it easier or harder for their various effects to be felt.\n",
            "controversiality": 0,
            "created_utc": 1388717742,
            "distinguished": null,
            "gilded": 0,
            "id": "cefzb7t",
            "link_id": "t3_1u79rq",
            "nest_level": 1,
            "parent_id": "t3_1u79rq",
            "reply_delay": 86284,
            "retrieved_on": 1431775458,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "drjgm74",
            "author_created_utc": 1388132998,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ej47b",
            "body": "No worries, this is hard to understand.\n\nThe signal is carried by the spread of electrical field across the cell membrane which is incredibly fast (instantaneous from our point of view). I don't think there is a second messenger involved in this situation. If there was the process would be slower.\n\nThere is a noticeable delay in neuronal synapses that is due to the time for neurotransmitter to diffuse across the synapse, and there would be a small delay taken for the action of each channel. Neurons don't fire \"that fast\", they are slow (you just think it's fast).",
            "controversiality": 0,
            "created_utc": 1388719246,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg00x2",
            "link_id": "t3_1u79rq",
            "nest_level": 5,
            "parent_id": "t1_cefkxtc",
            "reply_delay": 34539,
            "retrieved_on": 1431775805,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "aporetix",
            "author_created_utc": 1388611621,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_elrxn",
            "body": "The Sinaur animation found [here](http://sites.sinauer.com/neuroscience5e/animations05.02.html) provides an (admittedly cartoonish) illustration that may help clear things up on this point. \n\nPart of the confusion (including in some of the comments/follow-up questions below) seems to be related to \n\n1) mixing up/not distinguishing between receptors and ion channels; \n2) mixing up/not distinguishing between different types of receptors;\n3) mixing up/not distinguishing between different types of ion channels\n\nThe receptors (pre- or post-synaptic) bind an endogenous ligand and then do *something*, depending on the receptor type. Below you talk about the receptor releasing a protein. That's a metabotropic receptor. Perhaps counterintuitively (again, based on some things below in the thread), this secondary messenger action is much slower and is not the basis for the action potential. In contrast, some receptors control an ion channel. These ionotropic receptors are fast acting and the influx or efflux of ions that results from opening the ion channels is responsible for **local** changes in the membrane potential. \n\nSome ion channels are ligand-gated (i.e., open when receptor complex is bound to appropriate ligand). Others are voltage-gated (i.e., open/close as a function of **local** membrane potential). Charge flows along the surface of the membrane as you might expect--but it is important not to confuse these small, local, **graded** potentials with the action potential. If it helps, you can think of it as the difference between digital and analog signals. \n\nAs pointed out by [/u/SandyBaller](http://www.reddit.com/u/SandyBaller), the entire neuron does not reverse polarity simulataneously when a receptor is activated. BUT the membrane portion surrounding the soma **does** still have local depolarizations that diffuse across its surface. Perturbations in the **extremely** local relative ion concentrations combine with the voltage-gated ion channels, resulting in a potential that flows along the membrane in all directions away from the initial site These potentials are small deflections on their own. It's worth noting here that we commonly talk about a neuron's resting potential, but in reality the membrane is essentially undergoing tiny fluctuations in multiple locations at any given time. That brings us to summation and the integration zone. \n\nThere are two types of summation: spatial and temporal. When multiple receptors receive a signal at the same time, the resulting local depolarizations co-occur and, as a result, produce a greater net change in membrane potential in *some* areas of the membrane (that being the portion where the flows from the n&gt;=2 separate depolarizations run into each other). At this point it's important to note what ion channels we're talking about. Every local depolarizations doesn't trigger an action potential because until the membrane potential reaches a critical threshold (say ~-45mv) potassium and sodium are flowing in opposite directions. The influx of sodium depolarizes the local area--but potassium is immediately pushed out (electrostatic pressure). The efflux of potassium is greater (higher permeability), so the charge drops back to ~baseline almost immediately. When the local potential hits threshold, sodium channels in the region open completely and the flow of potassium isn't great enough to preserve/restore the potential. That resulting flip in polarity propagates down the axon via (loosely) the chain reaction of sodium ion channels you mentioned inittially. \n\ntl;dr: Not exactly. The whole (pre-axonic) membrane contributes input continuously until the situation in the integration zone reaches critical mass. \n",
            "controversiality": 0,
            "created_utc": 1388720788,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg0r72",
            "link_id": "t3_1u79rq",
            "nest_level": 1,
            "parent_id": "t3_1u79rq",
            "reply_delay": 89330,
            "retrieved_on": 1431776150,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "aporetix",
            "author_created_utc": 1388611621,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_elrxn",
            "body": "&gt; postsynaptic receptors scattered throughout the cell membrane but there was a greater number of receptors at, or just distal to, the Axon Hillock.\n\nThis seems to be conflating receptors with ion channels. Otherwise, the axo-somatic synapse type described is (so far as we know) relatively rare. ",
            "controversiality": 0,
            "created_utc": 1388721123,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg0wws",
            "link_id": "t3_1u79rq",
            "nest_level": 4,
            "parent_id": "t1_cefhgnl",
            "reply_delay": 45649,
            "retrieved_on": 1431776221,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "drjgm74",
            "author_created_utc": 1388132998,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_ej47b",
            "body": "Yes, in this case the term \"receptor\" is synonymous with \"ligand-\" or \"voltage-\" \"gated cation channel\", specifically one type of cell surface sodium channel.\n\nThese receptors are channels. The terms are interchangeable. Not all receptors are channels of course, but the fastest receptors such as those in neurons are mostly ion channels.\n\nProbably the best example of a ligand gated cation channels is the nicotinic AcetylCholine Receptor in the motor end plate.\n\nProbably the best example for voltage gated channels is the sodium channel in the neurons and myocytes. These are faster than calcium and potassium channels and are responsible for the actual initial generation of the Action Potential in these tissues.\n\nWhat did you mean? Maybe we are talking about different things.",
            "controversiality": 0,
            "created_utc": 1388723404,
            "distinguished": null,
            "edited": 1388723849,
            "gilded": 0,
            "id": "ceg1yoj",
            "link_id": "t3_1u79rq",
            "nest_level": 5,
            "parent_id": "t1_ceg0wws",
            "reply_delay": 2281,
            "retrieved_on": 1431776717,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388726785,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg3fpp",
            "link_id": "t3_1u79rq",
            "nest_level": 6,
            "parent_id": "t1_ceg1yoj",
            "reply_delay": 3381,
            "retrieved_on": 1431777406,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388748873,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg8nm8",
            "link_id": "t3_1u79rq",
            "nest_level": 7,
            "parent_id": "t1_ceg3fpp",
            "reply_delay": 22088,
            "retrieved_on": 1431779954,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "SandyBaller",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": " Good question; first you should understand the principles of the Nernst equation: http://en.wikipedia.org/wiki/Nernst_equation\nSimply put, the strength of a electrochemical signal will fade over a distance. \n\n\nWith this in mind,:\n\n\n&gt; So the postsynaptic receptors release a protein that goes to the Hillock's trigger zone and activates the cation channels (to contribute to the charge sum) there only?\n\nSort of; remember that most postsynaptic receptors are on dendrites and not the cell body. So yes, NTs arriving at a dendrite will cause that specific dendrite to have an effect (depolarize/hyperpolarize/other) by affecting receptors such as ion channels there. The NTs do not travel to the axon hillock, but rather cause an effect at the location of the synapse. KEY CONCEPT HERE: We refer to these as IPSPs (inhibitory post synaptic potentials) or EPSPs (excitatory). Think of these as mini-action potentials.\n\n\nIf you want this cell to fire an AP, you will need to add up all the IPSPs and EPSPs, and an AP will be fired if the resulting charge reaches threshold at the axon hillock. This is where the Nernst equation comes into play - the CLOSER the depolarized portions are to the axon hillock, the more they will affect the charge of that area. So a dendrite that is close to the axon that is depolarized may play a larger role in determining whether or not an AP will fire than a dendrite far away from the axon. Similarly, a dendrite receiving MORE action potentials (this is intensity) will affect the charge more than a dendrite that gets few IPSPs. \n\n\n*tl;dr* The cell will only be affected at the location of the synapse in the form of IPSPs and EPSPs, but the charge propagates a set distance and set time through the cell. The total excitation charge at the axon hillock must reach threshold to fire an AP.",
            "controversiality": 0,
            "created_utc": 1388755649,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg9sms",
            "link_id": "t3_1u79rq",
            "nest_level": 3,
            "parent_id": "t1_cefe514",
            "reply_delay": 97770,
            "retrieved_on": 1431780490,
            "score": 2,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "SandyBaller",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "You are technically correct, but this is more or less just a matter of semantics. Keep in mind that the axon hillock itself is not a real structure and different texts describe it in different ways. It's really only used to explain the principle of action potentials. ",
            "controversiality": 0,
            "created_utc": 1388755756,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg9tf2",
            "link_id": "t3_1u79rq",
            "nest_level": 3,
            "parent_id": "t1_cefckf9",
            "reply_delay": 106380,
            "retrieved_on": 1431780501,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        }
    ]
}