{
    "data": [
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388684603,
            "distinguished": null,
            "gilded": 0,
            "id": "cefkw5a",
            "link_id": "t3_1u880d",
            "nest_level": 1,
            "parent_id": "t3_1u880d",
            "reply_delay": 15232,
            "retrieved_on": 1431768511,
            "score": -9,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "KillYourCar",
            "author_created_utc": 1335971414,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_7m6pr",
            "body": "As a cardiologist and not a pulmonologist I'll take a stab at this. I'm not sure there needs to be a direct benefit of bronchial constriction. At least not in the way I think you are implying in your question. There is smooth muscle in our airways, true. This muscle allows for reactivity of airways in normal, physiological ways. For example, our bodies have ways of shunting blood or air to/from parts of the lungs that are over/under ventilated or perfused. Reactivity of airways and blood vessels are necessary to accomplish this. But asthma, for example, is a maladaptation of this. Hypertension would be a cardiovascular example of such a maladaptation in the vascular space.\n\nIn a broader, somewhat more philosophical sense, the definition of disease is something along the lines of abnormal function of tissue, organ, organism, etc. But there has to be a normal, adaptive function to start from.\n\nEDIT: I just re-read my response and thought I'd elaborate/clarify something. There is a notion of matching ventilation and perfusion within the lungs. This is a helpful/necessary adaptation as it is harmful (or wastes energy unnecessarily, etc) to have areas of lung that aren't getting blood but are getting oxygen and areas of lung that are getting blood but aren't getting oxygen. The latter is a \"shunt\" where blood is passing through the lungs and not oxygenating. The former is \"dead space\" where lung is filling with oxygen and not getting blood supply. So the system is made to \"self-regulate\" to adjust all this. It's a pretty fascinating, well-tuned machine in normal circumstances. Something as simple as going from a supine posture to an upright posture (which we do quite a bit as humans...alligators have less of a problem) causes more blood to go to the lower lungs (higher hydrostatic pressure) and less air/oxygen (compression of alveoli in the lower lung fields, expansion of alveoli in the upper lung fields). So the muscle that constricts in our lungs is part of this system. Bronchial constriction in a pathological sense is when this system goes awry. ",
            "controversiality": 0,
            "created_utc": 1388697847,
            "distinguished": null,
            "edited": 1388698676,
            "gilded": 0,
            "id": "cefr4m3",
            "link_id": "t3_1u880d",
            "nest_level": 1,
            "parent_id": "t3_1u880d",
            "reply_delay": 28476,
            "retrieved_on": 1431771521,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388750842,
            "distinguished": null,
            "gilded": 0,
            "id": "ceg8ybf",
            "link_id": "t3_1u880d",
            "nest_level": 1,
            "parent_id": "t3_1u880d",
            "reply_delay": 81471,
            "retrieved_on": 1431780093,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "N_icholas1985",
            "author_created_utc": 1388786977,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_emztb",
            "body": "As a Respiratory Therapist I've been taught that bronchoconstriction is a lung protective measure which is useful in such case as when dust or some other small particle is inhaled. In normal people its a transient and beneficial state. Should such a particle reach the alveolar level, normal pulmonary gas exchange would be interrupted (particularly the absorption of oxygen). In asthmatics this action is over reactive, and due to this, much as working out at the gym creates hypertrophic skeletal muscle, bronchial smooth muscle increases, which decreases the diameter of the bronchial (the passage to the alveoli). It becomes a self-reinforcing irritation, bronchoconstriction, inflammation, tissue death, scaring, smooth hypertrophy kind of cycle. If it cannot be controlled pharmacologically or basic risk aversion, there is new procedure called bronchial thermoplasty which burns away the smooth muscle in the lungs. I mention it as often as a I can. Of course, it all comes down to what insurance company you have :(.",
            "controversiality": 0,
            "created_utc": 1388788442,
            "distinguished": null,
            "gilded": 0,
            "id": "cegn1pw",
            "link_id": "t3_1u880d",
            "nest_level": 1,
            "parent_id": "t3_1u880d",
            "reply_delay": 119071,
            "retrieved_on": 1431786929,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        }
    ]
}