{
    "data": [
        {
            "author": "afatsumcha",
            "author_created_utc": 1256497795,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_3oy0m",
            "body": "To understand what's going on here, you have to have a good grasp of oxidative phosphorylation. The process of oxphos is, essentially, moving electrons to oxygen while at the same time creating a high proton gradient. The proton gradient powers a tiny little motor that physically/chemically attaches an extra phosphate group to adenosine diphosphate (ADP). This is SUPER important because ATP powers a whole lot of reactions at the cellular level. Imagine the water turbine--there is a higher concentration of water on one side than the other, and this pushes a motor to create electricity. In oxphos, we have a higher concentration of protons that push a motor to create ATP. \n\nNAD+ is used as a carrier for protons. So, with less NAD+ there is decreased movement of protons that create a gradient, and consequently less turning of the ATP-synthesizing motor. Similarly, with hypoxia (a lack of oxygen in tissue), there is no final electron acceptor. Oxygen is a necessary step in oxphos, otherwise the whole system gets backed up and can't move protons. So, both hypoxia and NAD+ depletion lead to decreased turning of the ATP synthase. \n\nTo continue the water turbine analogy, consider clouds to be analogous to NAD+. Clouds feed the river water, which then pushes the turbine. Without clouds feeding the river water, there is a lower concentration of water, thus less electricity produced. Consider the amount of oxygen to be analogous to the size of the water turbine. With a smaller hole (less oxygen), there is less water passed through, and less electricity produced. Each component leads to less overall energy produced, so a lack of clouds (decreased NAD+) can be considered equivalent to a smaller hole (hypoxia). This is why it's called pseudohypoxia.\n\nWell....I've rambled on enough for now. Lmk if I can explain this any better. ",
            "controversiality": 0,
            "created_utc": 1388683180,
            "distinguished": null,
            "gilded": 0,
            "id": "cefk98u",
            "link_id": "t3_1u8kuc",
            "nest_level": 1,
            "parent_id": "t3_1u8kuc",
            "reply_delay": 2005,
            "retrieved_on": 1431768212,
            "score": 7,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388683409,
            "distinguished": null,
            "gilded": 0,
            "id": "cefkcvr",
            "link_id": "t3_1u8kuc",
            "nest_level": 2,
            "parent_id": "t1_cefk98u",
            "reply_delay": 229,
            "retrieved_on": 1431768259,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "sirolimusland",
            "author_created_utc": 1358543174,
            "author_flair_css_class": null,
            "author_flair_text": null,
            "author_fullname": "t2_aa1fd",
            "body": "As eukaryotic organisms age, they experience many defects. One such defect is a loss of optimal levels of NAD+ within cells. According to this paper, this decline results in another problem entirely: the communication between mitochondria and nucleus in the cell breaks down. The reason this happens appears to be that loss of NAD+ mimics hypoxia (low oxygen).\n\nMitochondria don't like hypoxia: they need oxygen to act as the final electron acceptor in the electron transport chain (or oxidative phosphorylation).\n\nThe idea behind the paper is that this one additional mechanism that may be responsible for phenotypes associated with aging.",
            "controversiality": 0,
            "created_utc": 1388697112,
            "distinguished": null,
            "gilded": 0,
            "id": "cefqry2",
            "link_id": "t3_1u8kuc",
            "nest_level": 1,
            "parent_id": "t3_1u8kuc",
            "reply_delay": 15937,
            "retrieved_on": 1431771355,
            "score": 3,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e"
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388698014,
            "distinguished": null,
            "gilded": 0,
            "id": "cefr7le",
            "link_id": "t3_1u8kuc",
            "nest_level": 2,
            "parent_id": "t1_cefqry2",
            "reply_delay": 902,
            "retrieved_on": 1431771560,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        },
        {
            "author": "[deleted]",
            "author_flair_css_class": null,
            "author_flair_text": null,
            "body": "[deleted]",
            "controversiality": 0,
            "created_utc": 1388698220,
            "distinguished": null,
            "gilded": 0,
            "id": "cefrba8",
            "link_id": "t3_1u8kuc",
            "nest_level": 2,
            "parent_id": "t1_cefk98u",
            "reply_delay": 15040,
            "retrieved_on": 1431771610,
            "score": 1,
            "score_hidden": false,
            "subreddit": "askscience",
            "subreddit_id": "t5_2qm4e",
            "user_removed": true
        }
    ]
}